{
  "name": "Kunyu Wu(吴堃宇)",
  "title": "Undergraduate Student & Researcher",
  "description": "Passionate about Photonics, Sensors, and Artificial Intelligence research.",
  "nav": {
    "home": "Home",
    "about": "About",
    "publications": "Publications",
    "awards": "Awards",
    "hobbies": "Hobbies"
  },
  "home": {
    "aboutDesc": "Learn more about my background, experience, and skills",
    "publicationsDesc": "Explore my research papers and academic publications",
    "awardsDesc": "View my achievements and recognitions",
    "hobbiesDesc": "Discover my interests and activities outside work"
  },
  "about": {
    "title": "About Me",
    "location": "Sichuan University Pittsburgh Institute, China",
    "aboutMe": "About Me",
    "description": "I am a final-year undergraduate in Electrical and Computer Engineering at Sichuan University Pittsburgh Institute (SCUPI), graduating in 2026 with a GPA of 3.95/4.00 (top of my cohort). My research lies at the intersection of photonics and artificial intelligence, where I develop physics-informed models, photonic devices, and machine learning methods for sensing, wireless propagation, and intelligent system design.",
    "description2": "I have authored or co-authored 8 journal papers and 2 conference papers. My long-term goal is to pursue a PhD in Photonics + AI to address challenges in sensing, communication, and computational hardware.",
    "experience": "Research Experience",
    "job1": {
      "title": "Research Assistant",
      "company": "Intelligent Control Research Institute, Sichuan University",
      "period": "Sep 2023 – Mar 2024",
      "description": "Worked on acoustic sensing. Designed the ATTRN (Transformer-CNN) model for temperature field reconstruction."
    },
    "job2": {
      "title": "Research Assistant",
      "company": "N/MEMS-Lab, Sichuan University",
      "period": "Jun 2024 – Jul 2025",
      "description": "Researched MEMS-integrated photonic devices and metamaterials, including a π-shaped infrared absorber and KI-shaped terahertz resonator. Conducted FDTD simulations, equivalent circuit modelling, and MEMS-based reconfigurable design."
    },
    "job3": {
      "title": "Research Assistant",
      "company": "Sichuan University Pittsburgh Institute",
      "period": "Sep 2024 – Present",
      "description": "Focused on physics-informed machine learning for EM propagation and wireless systems. Developed PLAPN, a CNN–attention hybrid model for tunnel propagation."
    },
    "education": "Education",
    "degree": "BEng in Electrical and Computer Engineering",
    "university": "Sichuan University",
    "graduation": "2026 (Expected)",
    "major": "Specialized in Photonics and AI",
    "skills": "Research Areas",
    "frontend": "FDTD Simulation, VPE Modeling, Photonics Device Design",
    "backend": "Python, C++, MATLAB, PyTorch, Machine Learning"
  },
  "publications": {
    "title": "Publications",
    "subtitle": "My research contributions and academic publications",
    "journalPapers": "Journal Papers",
    "paper1": {
      "title": " Generalizable Physics-Informed Long-Range Attentive Network for Radio Wave Propagation Modeling in Tunnels",
      "authors": "<b>Wu, K.</b>, Ni, K., Xu, H., Wang, J., Qin, H., Zhang, X., & Zhang, X.",
      "journal": "IEEE Transactions on Microwave Theory and Techniques",
      "year": "2025",
      "abstract": "We propose a physics-informed long-range attentive propagation network (PLAPN) with a sliding window strategy to accurately and efficiently predict long-range radio wave propagation in tunnels from short-range simulation data."
    },
    "paper2": {
      "title": "Intelligent Optimization of Wireless Access Point Deployment for Communication-Based Train Control Systems Using Deep Reinforcement Learning",
      "authors": "<b>Wu, K.</b>, Zhao, Q, Feng, Z., Qin, H., Zhang, X., & Zhang, X.",
      "journal": "IEEE Transactions on Intelligent Transportation Systems",
      "year": "2025",
      "abstract": "We develop a Deep Reinforce Learning (DRL)-driven framework combining physics-based PWE simulation, conditional Generative Adversarial Network (cGAN)-based data augmentation, and Dueling Deep Q-Network (DQN) optimization to achieve accurate, efficient, and robust access point placement for CBTC tunnel systems."
    },
    "paper3": {
      "title": "Tunable Perfect Absorber Using Symmetrical π-Shaped Infrared Metamaterial for Sensing Application",
      "authors": "<b>Wu, K.</b>, Zheng, D., Zhu, Y., Ye, Z., & Lin, Y.-S.",
      "journal": "Materials Today Communications",
      "year": "2025",
      "abstract": "We designed a MEMS-tunable π-shaped perfect absorber in the mid-infrared (MIR) range that enables dynamic dual-resonance control, polarization switching, and high-sensitivity refractive index sensing for advanced photonic applications."
    },
    "paper4": {
      "title": "ATTRN: Acoustic Information Encoder and Temperature Field Reconstruction Decoder Network for Boiler Temperature Field Reconstruction",
      "authors": "<b>Wu, K.</b>, Ni, K., Chen, L., Xu, H., Wang, J., Zhou, J., & Zhou, X.",
      "journal": "Sensors",
      "year": "2025",
      "abstract": "We developed an (Transformer-CNN-based) ATTRN machine learning model that directly predicts boiler furnace temperature fields from acoustic measurements (Time of flight), improving accuracy, generalization, and industrial applicability over traditional methods."
    },
    "paper5": {
      "title": "Enhancing Character-Coherent Role-Playing Dialogue with a Verifiable Emotion Reward",
      "authors": "Wang, J., <b>Wu, K.</b>, & Ouyang, Y.",
      "journal": "Information",
      "year": "2025",
      "abstract": "This paper introduces a Verifiable Emotion Reward (VER) to reduce emotional drift in role-playing with LLMs. We also construct CHARCO, a 230k multi-turn dataset with persona and emotion labels, and design a retrieval-augmented memory module. Experiments show improved emotional consistency, role fidelity, and dialogue coherence."
    },
    "paper6": {
      "title": "KI-Shaped Terahertz Metamaterial with Tunable Filtering, Attenuating, and Sensing Characteristics",
      "authors": "Ye, Z., Zheng, D., Zhu, Y., <b>Wu, K.</b>, & Lin, Y.-S.",
      "journal": "APL Materials",
      "year": "2025",
      "abstract": "Analyzed KI-shaped terahertz resonators, guiding parameter optimization to achieve tunable filtering, signal suppression, and refractive index sensing performance."
    },
    "paper7": {
      "title": "Trajectory-Regularized Localization in Asynchronous Acoustic Networks via Enhanced PSO Optimization",
      "authors": "Zhou, J., Zhao, Q, Feng, Z, <b>Wu, K.</b>, Zhang, L., & Qin, H.",
      "journal": "Sensors",
      "year": "2025",
      "abstract": "We propose a trajectory-based localization framework using ToA and FoA with an enhanced PSO solver. The method improves accuracy and robustness in asynchronous acoustic networks, keeping over 90% of errors within 3 m."
      },

    "conferencePapers": "Conference Papers",
    "conf1": {
      "title": "Vector Parabolic Equation-Driven Temporal Attention Model for Propagation Modeling in Tunnels",
      "authors": "Xu, H., Wang, J., <b>Wu, K.</b>, Zhao, Q, Qin, H., Zhang, X., & Zhang, X.",
      "conference": "IEEE MTT-S International Wireless Symposium",
      "year": "2025",
      "abstract": "Presented a temporal attention model for EM wave propagation in tunnels, driven by the vector parabolic equation. Manuscript accepted."
    },
    "conf2": {
      "title": "Conceptor-Augmented Regularization for RNN and LSTM Networks",
      "authors": "Zhao, D., Zhang, Z., Kang, Y., <b>Wu, K.</b>, Ouyang, Y., Qian, G., & Ouyang, Y., Qian, G.",
      "conference": "IEEE 2nd International Conference on Deep Learning and Computer Vision",
      "year": "2025",
      "abstract": "Introduced conceptor-augmented regularization to improve the generalization of RNN and LSTM networks."
    },

    "ArXiv": "ArXiv Papers",
    "arxiv1": {
      "title": "Enhancing Code LLMs with Reinforcement Learning in Code Generation: A Survey",
      "authors": "Wang, J., Zhang, Z., He, Y., Song, Y., Shi, T., Li, Y., Xu, H., <b>Wu, K.</b>, Qian, G., Chen, Q., & He, L.",
      "year": "2025",
      "description": "Survey on improving code generation in large language models (LLMs) using reinforcement learning techniques. arXiv preprint arXiv:2412.20367."
    },

    "viewPaper": "View Paper",
    "viewBook": "View Book",
    "download": "Download",
    "statistics": "Publication Statistics",
    "totalPapers": "Total Papers",
    "journalPapers": "Journal Papers",
    "conferencePapers": "Conference Papers",
    "books": "Books"
  },
"awards": {
  "title": "Awards & Recognition",
  "subtitle": "Honors and achievements throughout my career",

  "academicAwards": "Academic Awards",
  "award1": {
    "title": "Dean's List",
    "organization": "Sichuan University Pittsburgh Institute",
    "year": "2023",
    "description": "Recognized for academic excellence, ranking among the top students in the program."
  },
  "award2": {
    "title": "First-class Comprehensive Scholarship",
    "organization": "Sichuan University",
    "year": "2023",
    "description": "Awarded for outstanding overall performance in academics, research, and extracurricular activities."
  },
  "award3": {
    "title": "Outstanding Student",
    "organization": "Sichuan University",
    "year": "2023",
    "description": "Selected as one of the most distinguished students for academic achievement and leadership."
  },

  "researchAwards": "Research & Teaching Awards",
  "award4": {
    "title": "Outstanding Teaching Assistant",
    "organization": "Sichuan University Pittsburgh Institute",
    "year": "2024",
    "description": "Recognized for excellence in supporting undergraduate teaching and mentoring peers."
  },

  "professionalAwards": "Other Achievements",
  "award5": {
    "title": "6th Place – 800m Race",
    "organization": "Sichuan University Sports Games",
    "year": "2023",
    "description": "Achieved 6th place in the men's 800-meter race, demonstrating resilience and athletic performance."
  },

    "statistics": "Award Statistics",
    "totalAwards": "Total Awards",
    "academicAwards": "Academic Awards",
    "researchAwards": "Research Awards",
    "professionalAwards": "Professional Awards"
  },
  "hobbies": {
    "title": "Hobbies & Interests",
    "subtitle": "Activities and interests that keep me inspired and balanced",
    "photography": {
      "title": "Photography",
      "description": "Capturing moments and exploring the world through the lens. I enjoy landscape, portrait, and street photography."
    },
    "reading": {
      "title": "Reading",
      "description": "Avid reader of fiction, non-fiction, and science fiction. Books help me gain new perspectives and knowledge."
    },
    "hiking": {
      "title": "Hiking",
      "description": "Exploring nature trails and mountains. Hiking helps me stay active and connect with the natural world."
    },
    "cooking": {
      "title": "Cooking",
      "description": "Experimenting with different cuisines and recipes. Cooking is both therapeutic and a creative outlet."
    },
    "music": {
      "title": "Music",
      "description": "Listening to various genres including jazz, classical, and rock. Music inspires creativity and relaxation."
    },
    "travel": {
      "title": "Travel",
      "description": "Exploring new cultures and destinations. Travel broadens perspectives and creates lasting memories."
    },
    "recentActivities": "Recent Activities",
    "lastWeek": "Last Week",
    "thisWeek": "This Week",
    "activity1": "Completed a photography workshop",
    "activity2": "Finished reading 'The Art of Programming'",
    "activity3": "Hiked Mount Tamalpais",
    "activity4": "Cooked Italian pasta from scratch",
    "activity5": "Attended a jazz concert",
    "activity6": "Planned trip to Japan",
    "favoriteQuotes": "Favorite Quotes",
    "quote1": {
      "text": "The best way to predict the future is to invent it.",
      "author": "Alan Kay"
    },
    "quote2": {
      "text": "Life is what happens when you're busy making other plans.",
      "author": "John Lennon"
    }
  }

}